//масив лучше модифицировать, но при этом оставляем предедущие состояние (делаем return arr.map()
//все проверки на чесло делаем вначале функции
//rememmber abou foeEach
//сравнение с помощщю === (вменсто == 0)
//проверять или число nan (исп type of && is not NaN)
//sort( function(a > b)
//return b > a)
//обявлять перменнные вначали функици
//через for in не перибираем масив
//мемойзинг
//функция конструктор: функция не возвращает, но new делае чтоб возвращала
//Rectangular.apply({});
//scope chain
//замыкание это пеебор всех scope chain
//биндинг - на что будет указыватть this  внутри функции

//object.constructor.prototype 
//ще один метод взнати чи є прототип
//у обєкта нету  свойства prototype, оно есть только у функции
//методы записи в прототип
cirtcle.prototype.z = 12
//в каких способах нельзя наследоваться (когда обєкт функции коструктора  на который ссылается прототип принимает параметр)(input )
//если в create передать null то не сможем именть протим у обєкта
//какая проблема inner html
//МЕМОЙЗИНГ
//ПАТЕРН КОМПОЗИЯ ФУНКЦИЙ
// в задаче про песни все методы писать в прототипе (это очень в ООП)
//html 5 api чит як підгружати файлики замість форм
//чит про cors

//в домашке в задаче 2 запроса. узнать что пришли запрос использовать promise.all
// + роверка (количество юзеров, 89 не существует

//debaging tools on mobile phone
//more tools --> inspected devices)
//активировать режим разработчика на моб тел
//onami code
//zerg rush
//AMD common.js
//duglass Crocford - about code style
